; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-57)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b17)
    (on b17 b12)
    (on b12 b16)
    (on b16 b3)
    (on b3 b5)
    (on b5 b7)
    (on b7 b13)
    (on b13 b15)
    (on-table b15)
    (clear b4)
    (on b4 b6)
    (on-table b6)
    (clear b11)
    (on b11 b9)
    (on-table b9)
    (clear b1)
    (on b1 b8)
    (on b8 b2)
    (on b2 b10)
    (on-table b10))
 (:goal (and 
(clear b12) (on b12 b14)
))
)

; plan
1. (unstack b14 b17)
   deleted: (on b14 b17) (clear b14) (arm-empty)
   added: (holding b14) (clear b17)
   goals met: 0 of 2
2. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 2
3. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 1 of 2
4. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 2
5. (unstack b12 b16)
   deleted: (on b12 b16) (clear b12) (arm-empty)
   added: (holding b12) (clear b16)
   goals met: 0 of 2
6. (stack b12 b14)
   deleted: (clear b14) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b14)
   goals met: 2 of 2
